## 6.1	Reading	and	Writing	Data	in	Text	Format

In [3]:
import numpy as np
import pandas as pd

In [2]:
ls -l

total 8
-rw-rw-r-- 1 zx zx 857 1月  14 09:45 Chapter?6.?Data?Loading,?Storage, and?File?Formats.ipynb
-rw-rw-r-- 1 zx zx  59 1月  14 09:51 example-1.csv

In [6]:
df = pd.read_csv('example-1.csv')

In [7]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
# read_table also works

df = pd.read_table('example-1.csv', sep=',')

In [12]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [13]:
# self-define header

df2 = pd.read_csv('ex2.csv')

In [14]:
df2

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [15]:
# assign a header 

df2 = pd.read_csv('ex2.csv', header=None)

In [16]:
df2

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [18]:
df2 = pd.read_csv('ex2.csv', names='a b c d message'.split())

In [19]:
df2

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [20]:
# assign message column as index

In [21]:
df2 = pd.read_csv('ex2.csv', names='a b c d message'.split(), index_col='message')

In [22]:
df2

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [28]:
# hierarchical index

df3 = pd.read_csv('ex3.csv', index_col=['key1', 'key2'])

In [29]:
df3

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [30]:
# 处理带有换行符的文本

data = list(open('ex4.txt'))

In [31]:
data

['A\t\t\t\t\t\t\t\t\tB\t\t\t\t\t\tC\n',
 'aaa\t-0.264438\t-1.026059\t-0.619500\n',
 'bbb\t\t0.927272\t\t0.302904\t-0.032399\n',
 'ccc\t-0.264273\t-0.386314\t-0.217601\n',
 'ddd\t-0.871858\t-0.348382\t\t1.100491\n']

In [32]:
# delimiter 接受正则表达式

df4 = pd.read_csv('ex4.txt', sep='\s+')

In [33]:
df4

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [34]:
#　escape some rows

In [35]:
!cat ex5.csv

#	hey!
a,b,c,d,message
#	just	wanted	to	make	things	more	difficult	for	you
#	who	reads	CSV	files	with	computers,	anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [36]:
df5 = pd.read_csv('ex5.csv', skiprows=[0, 2, 3])

In [37]:
df5

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [38]:
# handling missing data
!cat ex6.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [39]:
df6 = pd.read_csv('ex6.csv')

In [40]:
df6

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [41]:
pd.isnull(df6)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [42]:
# na_values

df6 = pd.read_csv('ex6.csv', na_values=['NULL'])

In [43]:
df6

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [44]:
# na_values for sentinels
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}

In [45]:
df6 = pd.read_csv('ex6.csv', na_values=sentinels)

In [46]:
df6

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

### Reading	Text	Files	in	Pieces

In [53]:
# generating a csv using padas and numpy

data = pd.DataFrame(np.random.randn(10000).reshape(2500, 4), columns='one two three four'.split())

In [55]:
data.to_csv('ex7.csv')

In [56]:
ls

Chapter?6.?Data?Loading,?Storage, and?File?Formats.ipynb  ex5.csv
ex2.csv                                                   ex6.csv
ex3.csv                                                   ex7.csv
ex4.txt                                                   example-1.csv

In [57]:
# read large file in pieces

In [58]:
pd.options.display.max_rows = 10

In [59]:
df7 = pd.read_csv('ex7.csv')

In [60]:
df7

      Unnamed: 0       one       two     three      four
0              0 -2.477720 -1.714394 -1.426591  0.450557
1              1  0.421192 -0.033491 -0.399306 -0.747412
2              2  1.271667  0.141948 -0.775194 -0.548996
3              3  0.105818 -1.204063 -1.759365  0.414876
4              4 -0.429390  2.879302 -0.258903  0.356071
...          ...       ...       ...       ...       ...
2495        2495 -0.682262  0.463521  0.324740 -0.195332
2496        2496  1.006981 -0.248487  1.089494 -0.759522
2497        2497  0.651397  0.683307  0.253615 -0.132589
2498        2498 -0.292384  0.571885  0.623364 -1.410463
2499        2499 -0.209891 -0.734058 -1.668086  0.057465

[2500 rows x 5 columns]

In [61]:
# only read a small number rows

In [62]:
pd.read_csv('ex7.csv', nrows=5)

   Unnamed: 0       one       two     three      four
0           0 -2.477720 -1.714394 -1.426591  0.450557
1           1  0.421192 -0.033491 -0.399306 -0.747412
2           2  1.271667  0.141948 -0.775194 -0.548996
3           3  0.105818 -1.204063 -1.759365  0.414876
4           4 -0.429390  2.879302 -0.258903  0.356071

In [63]:
# using chunksize 

chunker = pd.read_csv('ex7.csv', chunksize=1000)

In [64]:
chunker

### Writing	Data	to	Text	Format

In [65]:
data = pd.read_csv('ex6.csv')

In [66]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [67]:
import sys

In [68]:
data.to_csv(sys.stdout, sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [69]:
# for missing value

In [70]:
data.to_csv(sys.stdout, na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [71]:
# disable headers and indexs
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [73]:
# write a subset of the columns
data.to_csv(sys.stdout, index=False, columns=['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [74]:
data.to_csv(sys.stdout, index=[0,1])

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [75]:
# series' to_csv

dates = pd.date_range('1/1/2000', periods=7)

In [76]:
dates

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07'],
              dtype='datetime64[ns]', freq='D')

In [77]:
ts = pd.Series(np.arange(7), index=dates)

In [78]:
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int64

In [79]:
ts.to_csv('dates.csv')

In [80]:
!cat dates.csv

2000-01-01,0
2000-01-02,1
2000-01-03,2
2000-01-04,3
2000-01-05,4
2000-01-06,5
2000-01-07,6

### Working	with	Delimited	Formats

In [81]:
import csv

In [82]:
!cat ex8.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [83]:
f = open('ex8.csv')

In [84]:
reader = csv.reader(f)

In [85]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [86]:
# another way

with open('ex8.csv') as f:
    lines = list(csv.reader(f))

In [87]:
header, values = lines[0], lines[1:]

In [88]:
header

['a', 'b', 'c']

In [89]:
values

[['1', '2', '3'], ['1', '2', '3']]

In [90]:
dct = {h: v for h, v in zip(header, zip(*values))}

In [91]:
dct

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [92]:
# self-define dialect

In [93]:
class my_dialect(csv.Dialect):
    lineterminator = '\n'
    delimiter = ';'
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [97]:
f = open('ex8.csv')

In [98]:
reader = csv.reader(f, dialect=my_dialect)

In [101]:
for i in reader:
    print(i)

['a,"b","c"']
['1,"2","3"']
['1,"2","3"']

### JSON	Data

In [117]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain","Germany"],
"pet":null,
"siblings": [
{"name": "Scott", "age": 30, "pets": ["Zeus","Zuko"]},
{"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [103]:
type(obj)

str

In [104]:
import json

In [118]:
j = json.loads(obj)

In [119]:
j

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [120]:
sib = pd.DataFrame(j['siblings'], columns=['name', 'age'])

In [121]:
sib

    name  age
0  Scott   30
1  Katie   38